{"metadata":{"kernelspec":{"display_name":"Python 3","language":"python","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.7.8"}},"nbformat_minor":4,"nbformat":4,"cells":[{"cell_type":"markdown","source":"# Домашнее задание к лекции \"Введение в типы данных и циклы. Часть 1\"","metadata":{}},{"cell_type":"markdown","source":"## Задание 1","metadata":{}},{"cell_type":"markdown","source":"Дана переменная, в которой хранится слово из латинских букв. Напишите код, который выводит на экран:\n\nсреднюю букву, если число букв в слове нечетное;\nдве средних буквы, если число букв четное.\nПримеры работы программы:\n\nword = 'test'\nРезультат:\nes\n\nword = 'testing'\nРезультат:\nt","metadata":{}},{"cell_type":"code","source":"x = input('world =')\n\nostatok = len(x) / 2\nif len(x) % 2 == 0:\n    print(x[int(ostatok)-1:-1])\nelif len(x) % 2 != 0:\n    print(x[int(ostatok)-1:int(ostatok)])\n","metadata":{"trusted":true},"execution_count":43,"outputs":[{"output_type":"stream","name":"stdin","text":"world = fgdj\n"},{"name":"stdout","text":"gd\n","output_type":"stream"}]},{"cell_type":"code","source":"","metadata":{},"execution_count":null,"outputs":[]},{"cell_type":"code","source":"word = 'test'","metadata":{"trusted":true},"execution_count":23,"outputs":[]},{"cell_type":"code","source":"word [1:3]","metadata":{},"execution_count":3,"outputs":[{"execution_count":3,"output_type":"execute_result","data":{"text/plain":"'es'"},"metadata":{}}]},{"cell_type":"code","source":"word = 'testing' ","metadata":{},"execution_count":4,"outputs":[]},{"cell_type":"code","source":"word [3]","metadata":{},"execution_count":6,"outputs":[{"execution_count":6,"output_type":"execute_result","data":{"text/plain":"'t'"},"metadata":{}}]},{"cell_type":"markdown","source":"## Задание 2","metadata":{}},{"cell_type":"markdown","source":"Напишите программу, которая последовательно запрашивает у пользователя числа (по одному за раз) и после первого нуля выводит сумму всех ранее введенных чисел.\n\nПримеры работы программы:\n\nВведите число:  \n1\n\nВведите число:  \n4\n\nВведите число:  \n6\n\nВведите число:  \n0\nРезультат:\n11\n\nВведите число:  \n0\nРезультат:\n0","metadata":{}},{"cell_type":"code","source":"x = int(input('Введите число '))\nsumma = 0\nwhile x != 0:\n    summa += x\n    x = int(input('Введите число ')) \n    print (summa)","metadata":{},"execution_count":76,"outputs":[{"name":"stdout","output_type":"stream","text":"Введите число 5\nВведите число 3\n5\nВведите число 1\n8\nВведите число 0\n9\n"}]},{"cell_type":"markdown","source":"## Задание 3","metadata":{}},{"cell_type":"markdown","source":"Мы делаем MVP dating-сервиса, и у нас есть список парней и девушек.\nВыдвигаем гипотезу: лучшие рекомендации мы получим, если просто отсортируем имена по алфавиту и познакомим людей с одинаковыми индексами после сортировки! Но мы не будем никого знакомить, если кто-то может остаться без пары:\n\nПримеры работы программы:\n\nboys = ['Peter', 'Alex', 'John', 'Arthur', 'Richard']\ngirls = ['Kate', 'Liza', 'Kira', 'Emma', 'Trisha']\nРезультат:\n\nИдеальные пары:  \nAlex и Emma  \nArthur и Kate  \nJohn и Kira  \nPeter и Liza  \nRichard и Trisha\nboys = ['Peter', 'Alex', 'John', 'Arthur', 'Richard', 'Michael']\ngirls = ['Kate', 'Liza', 'Kira', 'Emma', 'Trisha']\nРезультат:\nВнимание, кто-то может остаться без пары!","metadata":{}},{"cell_type":"code","source":"boys = ['Peter', 'Alex', 'John', 'Arthur', 'Richard']\ngirls = ['Kate', 'Liza', 'Kira', 'Emma', 'Trisha']\nsogirls = sorted(girls)\nsoboys = sorted(boys)\nprint(sogirls)\nprint(soboys)","metadata":{"scrolled":true,"trusted":true},"execution_count":10,"outputs":[{"name":"stdout","text":"['Emma', 'Kate', 'Kira', 'Liza', 'Trisha']\n['Alex', 'Arthur', 'John', 'Peter', 'Richard']\n","output_type":"stream"}]},{"cell_type":"code","source":"boys_girls = zip(sogirls,soboys)\nprint(boys_girls)","metadata":{"trusted":true},"execution_count":17,"outputs":[{"name":"stdout","text":"<zip object at 0x7fa83c5bb500>\n","output_type":"stream"}]},{"cell_type":"code","source":"list(boys_girls)","metadata":{"trusted":true},"execution_count":18,"outputs":[{"execution_count":18,"output_type":"execute_result","data":{"text/plain":"[('Emma', 'Alex'),\n ('Kate', 'Arthur'),\n ('Kira', 'John'),\n ('Liza', 'Peter'),\n ('Trisha', 'Richard')]"},"metadata":{}}]},{"cell_type":"code","source":"print('Идеальные пары: ')\nfor boy, girl in zip(sogirls,soboys):\n    print(f'{boy} и {girl}')\n","metadata":{"trusted":true},"execution_count":22,"outputs":[{"name":"stdout","text":"Идеальные пары: \nEmma и Alex\nKate и Arthur\nKira и John\nLiza и Peter\nTrisha и Richard\n","output_type":"stream"}]},{"cell_type":"code","source":"","metadata":{},"execution_count":null,"outputs":[]},{"cell_type":"code","source":"boys = ['Peter', 'Alex', 'John', 'Arthur', 'Richard', 'Michael'] \ngirls = ['Kate', 'Liza', 'Kira', 'Emma', 'Trisha'] ","metadata":{"trusted":true},"execution_count":8,"outputs":[]},{"cell_type":"code","source":"while len(boys) != len(girls):\n    print('Внимание, кто-то может остаться без пары')\n    break","metadata":{"trusted":true},"execution_count":9,"outputs":[{"name":"stdout","text":"Внимание, кто-то может остаться без пары\n","output_type":"stream"}]},{"cell_type":"markdown","source":"## Задание 4","metadata":{}},{"cell_type":"markdown","source":"У нас есть список, содержащий информацию о среднедневной температуре в Фаренгейтах за произвольный период по странам (структура данных в примере). Необходимо написать код, который рассчитает среднюю температуру за период в Цельсиях(!) для каждой страны.\n\nПример работы программы:\n\ncountries_temperature = [\n    ['Thailand', [75.2, 77, 78.8, 73.4, 68, 75.2, 77]],\n    ['Germany', [57.2, 55.4, 59, 59, 53.6]],\n    ['Russia', [35.6, 37.4, 39.2, 41, 42.8, 39.2, 35.6]],\n    ['Poland', [50, 50, 53.6, 57.2, 55.4, 55.4]]\n]\nРезультат:\n\nСредняя температура в странах:\nThailand  -  23.9 С\nGermany  -  13.8 С\nRussia  -  3.7 С\nPoland  -  12.0 С","metadata":{}},{"cell_type":"code","source":"countries_temperature = [\n    ['Thailand', [75.2, 77, 78.8, 73.4, 68, 75.2, 77]],\n    ['Germany', [57.2, 55.4, 59, 59, 53.6]],\n    ['Russia', [35.6, 37.4, 39.2, 41, 42.8, 39.2, 35.6]],\n    ['Poland', [50, 50, 53.6, 57.2, 55.4, 55.4]]\n]","metadata":{},"execution_count":2,"outputs":[]},{"cell_type":"code","source":"print('Средняя температура в странах:')\nprint('')\nfor row in countries_temperature:\n    temp_sum = sum(row[1])\n    temp_avg = ((temp_sum/len(row[1])) - 32) * (5/9)\n    print(f'{row[0]} - {temp_avg}')","metadata":{},"execution_count":19,"outputs":[{"name":"stdout","output_type":"stream","text":"Средняя температура в странах:\n\nThailand - 23.857142857142854\nGermany - 13.799999999999999\nRussia - 3.714285714285717\nPoland - 11.999999999999998\n"}]}]}